Revit 2026 API

# SheetFailures Properties

---

The BuiltInFailuresSheetFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SheetNumberDuplicated | Sheet Number is already in use. Enter a unique number. |
|  | SheetNumberDuplicatedPerSheetCollection | Sheet Number is already in use. The same Sheet Number value can be used once for all sheets directly in the model, and once for all sheets per Sheet Collection. |
|  | SheetNumberEmpty | Sheet Number is empty |
|  | SheetScaleOverrideInvalid | The scale override parameter can only contain text, numeric values are not supported. |

#### Reference

BuiltInFailuresSheetFailures Class

Autodesk.Revit.DB Namespace